starter-kit-bindings.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Bindings</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Starter Kit Bindings"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-19T14:27+0200"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="stylesheets/styles.css">
             <link rel="stylesheet" href="stylesheets/org-pygments.css">

</head>
<body>

<div id="preamble">
<span><a title="home page" class="" href="http://xgarrido.dyndns.org/">home</a></span>
                     <span><a title="about" class="" href="http://xgarrido.dyndns.org/">about</a></span>
                     <span><a title="publication" class="" href="http://xgarrido.dyndns.org/">publication</a></span>
                     <span><a title="vitae" class="" href="http://xgarrido.dyndns.org/">vitae</a></span>
                     <span><a title="categories" class="" href="http://xgarrido.dyndns.org/">categories</a></span>
                     <span><a title="links" class="" href="http://xgarrido.dyndns.org/">links</a></span>
                     <span><a title="subscribe by RSS" class="" href="http://xgarrido.dyndns.org/">subscribe</a></span>
                     
</div>

<div id="content">
<h1 class="title">Starter Kit Bindings</h1>

<p>This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Starter Kit Bindings</h2>
<div class="outline-text-2" id="text-1">


<p>
Key Bindings.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Align your code in a pretty way</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"M-a"</span>) 'align-regexp)
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Completion that uses many different methods to find options</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"M-/"</span>) 'hippie-expand)
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Font size</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="src src-emacs-lisp">(define-key global-map (kbd <span class="org-string">"C-+"</span>) 'text-scale-increase)
(define-key global-map (kbd <span class="org-string">"C--"</span>) 'text-scale-decrease)
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Use regex searches by default</h3>
<div class="outline-text-3" id="text-1-4">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-s"</span>) 'isearch-forward-regexp)
(global-set-key (kbd <span class="org-string">"C-r"</span>) 'isearch-backward-regexp)
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">File finding</h3>
<div class="outline-text-3" id="text-1-5">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-o"</span>)     'find-file)
(global-set-key (kbd <span class="org-string">"C-x r"</span>)   'recentf-ido-find-file)
(global-set-key (kbd <span class="org-string">"C-x C-r"</span>) 'recentf-ido-find-file)
</pre>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Buffer handling</h3>
<div class="outline-text-3" id="text-1-6">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-x C-b"</span>) 'ibuffer)
(global-set-key (kbd <span class="org-string">"M-r"</span>)     'revert-buffer)
(global-set-key (kbd <span class="org-string">"C-w"</span>)     'kill-this-buffer)
(global-set-key (kbd <span class="org-string">"C-x C-k"</span>) 'sk-delete-current-buffer-file)
</pre>


</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Window switching (C-x o goes to the next window)</h3>
<div class="outline-text-3" id="text-1-7">




<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;</span><span class="org-comment">(windmove-default-keybindings) ;; Shift+direction</span>
(global-set-key (kbd <span class="org-string">"&lt;C-tab&gt;"</span>) 'other-window)
</pre>

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8">Window rotation</h3>
<div class="outline-text-3" id="text-1-8">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"&lt;s-tab&gt;"</span>) 'sk-toggle-window-split)
</pre>


</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9">Line operations</h3>
<div class="outline-text-3" id="text-1-9">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-l"</span>)   'goto-line)
(global-set-key (kbd <span class="org-string">"C-x ^"</span>) 'join-line)
(<span class="org-keyword">defun</span> <span class="org-function-name">backward-kill-line</span> (arg)
  <span class="org-doc">"Kill chars backward until encountering the end of a line."</span>
  (interactive <span class="org-string">"p"</span>)
  (kill-line 0))
(global-set-key (kbd <span class="org-string">"C-u"</span>)   'backward-kill-line)
(<span class="org-keyword">defun</span> <span class="org-function-name">move-line-up</span> ()
  (interactive)
  (transpose-lines 1)
  (forward-line -2))
(<span class="org-keyword">defun</span> <span class="org-function-name">move-line-down</span> ()
  (interactive)
  (forward-line 1)
  (transpose-lines 1)
  (forward-line -1))
(global-set-key (kbd <span class="org-string">"M-&lt;up&gt;"</span>)   'move-line-up)
(global-set-key (kbd <span class="org-string">"M-&lt;down&gt;"</span>) 'move-line-down)
(global-set-key (kbd <span class="org-string">"RET"</span>)      'reindent-then-newline-and-indent)
</pre>


</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10">Activate occur easily inside isearch</h3>
<div class="outline-text-3" id="text-1-10">




<pre class="src src-emacs-lisp">(define-key isearch-mode-map (kbd <span class="org-string">"C-o"</span>)
  (<span class="org-keyword">lambda</span> () (interactive)
    (<span class="org-keyword">let</span> ((case-fold-search isearch-case-fold-search))
      (occur (<span class="org-keyword">if</span> isearch-regexp
                 isearch-string
               (regexp-quote isearch-string))))))
</pre>


</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11">Undo/redo</h3>
<div class="outline-text-3" id="text-1-11">




<pre class="src src-emacs-lisp">(<span class="org-keyword">defalias</span> '<span class="org-function-name">redo</span> 'undo-tree-redo)
(global-set-key (kbd <span class="org-string">"C-z"</span>) 'undo)
(global-set-key (kbd <span class="org-string">"C-&amp;"</span>) 'redo)
</pre>


</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12">Smex</h3>
<div class="outline-text-3" id="text-1-12">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"M-x"</span>) 'smex)
</pre>


</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13">Buffer compilation</h3>
<div class="outline-text-3" id="text-1-13">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"C-c c"</span>) 'compile)
</pre>


</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14">Toggling fullscreen</h3>
<div class="outline-text-3" id="text-1-14">




<pre class="src src-emacs-lisp">(global-set-key [f11] 'sk-toggle-fullscreen)
</pre>

</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15">Multi-term</h3>
<div class="outline-text-3" id="text-1-15">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"M-m"</span>) 'multi-term)
</pre>

</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16">Magit</h3>
<div class="outline-text-3" id="text-1-16">




<pre class="src src-emacs-lisp">(global-set-key (kbd <span class="org-string">"M-s"</span>) 'magit-status)
</pre>

</div>
</div>
</div>
</div>

</body>
</html>
